renesas/rx-driver-package/source/r_sdsi_rx/r_sdsi_rx_vx.xx/r_sdsi_rx/src/targets/rx65n/r_sdsi_dev.c
/**********************************************************************************************************************
* DISCLAIMER
* This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products. No 
* other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all 
* applicable laws, including copyright laws. 
* THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
* THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY, 
* FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM 
* EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES 
* SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO THIS
* SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
* Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of 
* this software. By using this software, you agree to the additional terms and conditions found by accessing the 
* following link:
* http://www.renesas.com/disclaimer 
*
* Copyright (C) 2016(2019) Renesas Electronics Corporation. All rights reserved.    
**********************************************************************************************************************/
/**********************************************************************************************************************
* System Name  : SDSI Driver
* File Name    : r_sdsi_dev.c
* Version      : 2.02
* Device       : RX65N
* Abstract     : API & Sub module
* Tool-Chain   : -
* OS           : not use
* H/W Platform : RSK board for RX65N
* Description  : Interface file for SDSI API for RX
* Limitation   : None
**********************************************************************************************************************/
/**********************************************************************************************************************
* History      : DD.MM.YYYY Version Description
*              : 30.09.2016 1.00    First Release
*              : 31.07.2017 2.00    Supported RX65N-2MB.
*              :                    Fixed to correspond to Renesas coding rule.
*              : 04.04.2019 2.02    Added support for GNUC and ICCRX.
*                                   Fixed coding style.
**********************************************************************************************************************/

/**********************************************************************************************************************
Includes <System Includes> , "Project Includes"
**********************************************************************************************************************/
#include "platform.h"
#if defined(BSP_MCU_RX65N)

#include "r_sdsi_rx_if.h"
#include ".\src\r_sdsi_rx_private.h"

#if (SDSI_CFG_CH0_INT_LEVEL < 1) || (SDSI_CFG_CH0_INT_LEVEL > 15)
    #error "ERROR !!! You must set (1) - (15) in SDSI_CFG_CH0_INT_LEVEL."
#endif /* (SDSI_CFG_CH0_INT_LEVEL < 1) || (SDSI_CFG_CH0_INT_LEVEL > 15) */

#if !defined(SDSI_CFG_CH0_INCLUDED)
    #error "ERROR !!! You must define SDSI_CFG_CH0_INCLUDED."
#endif /* !defined(SDSI_CFG_CH0_INCLUDED) */

/**********************************************************************************************************************
Macro definitions
**********************************************************************************************************************/
#define SDSI_IPL_LEVEL               (15)

/* Software delay */
#define SDSI_OVERHEAD_LOOP_COUNT     (4)
        /* Overhead of 20 cycles or 4 loops to call/return from r_sdsi_dev_delaywait() function. */
#define SDSI_CPU_CYCLES_PER_LOOP     (5)
        /* Known number (5) of CPU cycles required to execute the r_sdsi_dev_delaywait() loop. */

/**********************************************************************************************************************
Typedef definitions
**********************************************************************************************************************/

/**********************************************************************************************************************
Private global variables and functions
**********************************************************************************************************************/

#ifdef SDSI_CFG_USE_FIT
/**********************************************************************************************************************
* Outline      : Hardware Lock
* Function Name: r_sdsi_dev_hardware_lock
* Description  : Hardware Lock.
* Arguments    : uint32_t           channel     ; Channel No.
* Return Value : true                           ; Lock was acquired.
*              : false                          ; Lock was not acquired.
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
bool r_sdsi_dev_hardware_lock(uint32_t channel)
{
    return R_BSP_HardwareLock((mcu_lock_t)(BSP_LOCK_SDSI + channel));
} /* End of function r_sdsi_dev_hardware_lock() */

/**********************************************************************************************************************
* Outline      : Hardware Unlock
* Function Name: r_sdsi_dev_hardware_unlock
* Description  : Hardware Unlock.
* Arguments    : uint32_t           channel     ; Channel No.
* Return Value : true                           ; Lock was released.
*              : false                          ; Lock was not released.
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
bool r_sdsi_dev_hardware_unlock(uint32_t channel)
{
    return R_BSP_HardwareUnlock((mcu_lock_t)(BSP_LOCK_SDSI + channel));
} /* End of function r_sdsi_dev_hardware_unlock() */
#endif /* SDSI_CFG_USE_FIT */

/**********************************************************************************************************************
* Function Name: r_sdsi_dev_module_enable
* Description  : Enables the peripheral module.
* Arguments    : uint32_t           channel              ;   SDSI Channel No.
* Return Value : SDSI_SUCCESS                            ;   Successful operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        :  None
**********************************************************************************************************************/
sdsi_status_t r_sdsi_dev_module_enable(uint32_t channel)
{
#ifdef SDSI_CFG_USE_FIT
    R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);
    MSTP_SDSI = 0;              /* SDSI ON */
    if (0 == MSTP_SDSI)
    {
        R_BSP_NOP();    /* Wait for the write completion. */
    }
    R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_LPC_CGC_SWR);
#else
    SYSTEM.PRCR.WORD = 0xA502;
    if (0xA502 == SYSTEM.PRCR.WORD)
    {
        R_BSP_NOP();    /* Wait for the write completion. */
    }

    MSTP_SDSI = 0;              /* SDSI ON */
    if (0 == MSTP_SDSI)
    {
        R_BSP_NOP();    /* Wait for the write completion. */
    }

    SYSTEM.PRCR.WORD = 0xA500;
    if (0xA500 == SYSTEM.PRCR.WORD)
    {
        R_BSP_NOP();    /* Wait for the write completion. */
    }
#endif /* SDSI_CFG_USE_FIT */

    if (SDSI_CH0 == channel)    /* SDSI_CH0 */
    {
#if defined(SDSI_CFG_CH0_INCLUDED)
#ifdef SDSI_CFG_USE_FIT
        R_BSP_InterruptWrite(BSP_INT_SRC_BL2_SDSI_SDIOI, R_SDSI_IntHandler0);
#endif /* SDSI_CFG_USE_FIT */
#endif  /* SDSI_CFG_CH0_INCLUDED */
    }
    else
    {
        /* Do nothing. */
    }

    return SDSI_SUCCESS;
} /* End of function r_sdsi_dev_module_enable() */


/**********************************************************************************************************************
* Function Name: r_sdsi_dev_module_disable
* Description  : Disables the peripheral module.
* Arguments    : uint32_t           channel              ;   SDSI Channel No.
* Return Value : SDSI_SUCCESS                            ;   Successful operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
sdsi_status_t r_sdsi_dev_module_disable(uint32_t channel)
{
#ifdef SDSI_CFG_USE_FIT
    R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);
    MSTP_SDSI = 1;              /* SDSI OFF */
    if (1 == MSTP_SDSI)
    {
        R_BSP_NOP();    /* Wait for the write completion. */
    }
    R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_LPC_CGC_SWR);
#else
    SYSTEM.PRCR.WORD = 0xA502;
    if (0xA502 == SYSTEM.PRCR.WORD)
    {
        R_BSP_NOP();    /* Wait for the write completion. */
    }

