renesas/rx-driver-package/source/r_sdsi_rx/r_sdsi_rx_vx.xx/r_sdsi_rx/src/targets/rx65n/r_sdsi_dev.c
    MSTP_SDSI = 1;              /* SDSI OFF */
    if (1 == MSTP_SDSI)
    {
        R_BSP_NOP();    /* Wait for the write completion. */
    }

    SYSTEM.PRCR.WORD = 0xA500;
    if (0xA500 == SYSTEM.PRCR.WORD)
    {
        R_BSP_NOP();    /* Wait for the write completion. */
    }
#endif /* SDSI_CFG_USE_FIT */

    if (SDSI_CH0 == channel)
    {
#if defined(SDSI_CFG_CH0_INCLUDED)
#ifdef SDSI_CFG_USE_FIT
        R_BSP_InterruptWrite(BSP_INT_SRC_BL2_SDSI_SDIOI, FIT_NO_FUNC);
#endif /* SDSI_CFG_USE_FIT */
#endif  /* SDSI_CFG_CH0_INCLUDED */
    }
    else    /* SDSI_CH1 */
    {
        /* Do nothing. */
    }

    return SDSI_SUCCESS;
} /* End of function r_sdsi_dev_module_disable() */

/**********************************************************************************************************************
* Function Name: r_sdsi_dev_disable_system_int
* Description  : Set to disable all interrupts.
* Arguments    : uint32_t           channel              ;   SDSI Channel No.
* Return Value : SDSI_SUCCESS                            ;   Successful operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        :  None
**********************************************************************************************************************/
sdsi_status_t r_sdsi_dev_disable_system_int(uint32_t channel)
{
#if defined(SDSI_CFG_DISABLE_SYSTEM_INTERRUPT)
    #ifdef SDSI_CFG_USE_FIT
        R_BSP_InterruptsDisable();
    #else
        #if defined(__RENESAS__)
        /* Use the compiler intrinsic function to clear the I flag. This function is available with for the Renesas RX 
           compiler. This may need to be changed for other compilers. */
        R_BSP_CLRPSW_I();
        #endif /* __RENESAS__ */
    #endif /* SDSI_CFG_USE_FIT */
#endif /* SDSI_CFG_DISABLE_SYSTEM_INTERRUPT */
    return SDSI_SUCCESS;
} /* End of function r_sdsi_dev_disable_system_int() */

/**********************************************************************************************************************
* Function Name: r_sdsi_dev_enable_system_int
* Description  : Get to disable all interrupts.
* Arguments    : uint32_t           channel              ;   SDSI Channel No.
* Return Value : SDSI_SUCCESS                            ;   Successful operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        :  None
**********************************************************************************************************************/
sdsi_status_t r_sdsi_dev_enable_system_int(uint32_t channel)
{
#if defined(SDSI_CFG_DISABLE_SYSTEM_INTERRUPT)
    #ifdef SDSI_CFG_USE_FIT
        R_BSP_InterruptsEnable();
    #else
        #if defined(__RENESAS__)
        /* Use the compiler intrinsic function to set the I flag. This function is available with for the Renesas RX 
           compiler. This may need to be changed for other compilers. */
        R_BSP_SETPSW_I();
        #endif /* __RENESAS__ */
    #endif /* SDSI_CFG_USE_FIT */
#endif /* SDSI_CFG_DISABLE_SYSTEM_INTERRUPT */
    return SDSI_SUCCESS;
} /* End of function r_sdsi_dev_enable_system_int() */

/**********************************************************************************************************************
* Function Name: r_sdsi_dev_open
* Description  : Sets SDSI register for R_SDSI_Open() function.
* Arguments    : uint32_t           channel              ;   SDSI Channel No.
* Return Value : SDSI_SUCCESS                            ;   Successful operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        :  None
**********************************************************************************************************************/
sdsi_status_t r_sdsi_dev_open(uint32_t channel)
{
    sdsi_hndl_t * p_hndl = 0;

    p_hndl = SDSI_GET_HNDL(channel);

    /* Reset SDSI. */
    /* Disable CCCR.IOR0(Function0). */
    SDSI_OUTREG_LONG(p_hndl, SDSI_SDSICR3,  SDSI_SDSICR3_SRST_ENABLE);
    if (0 == SDSI_INREG_LONG(p_hndl, SDSI_SDSICR3))
    {
        R_BSP_NOP();    /* Wait for the write completion. */
    }
    SDSI_OUTREG_LONG(p_hndl, SDSI_SDSICR3,  SDSI_SDSICR3_SRST_DISABLE);
    if (0 == SDSI_INREG_LONG(p_hndl, SDSI_SDSICR3))
    {
        R_BSP_NOP();    /* Wait for the write completion. */
    }

    /* Disable SDSI interrupts and cleer SDSI status register. */
/*  SDSI_OUTREG_BYTE(p_hndl, SDSI_INTENCR1, SDSI_INTENCR1_DISABLE); */ /* Clear by SDSI reset. */
    SDSI_OUTREG_LONG(p_hndl, SDSI_INTENCR2, SDSI_INTENCR2_DISABLE);
/*  SDSI_OUTREG_BYTE(p_hndl, SDSI_INTSR1,   SDSI_INTSR1_INIT); */ /* Clear by SDSI reset. */
    SDSI_OUTREG_LONG(p_hndl, SDSI_INTSR2,   SDSI_INTSR2_INIT);

    /* Enable access to function1 by the CPU. */
    SDSI_OUTREG_LONG(p_hndl, SDSI_FN1ACCR,  SDSI_FN1ACC_ENABLE); 

    return SDSI_SUCCESS;
} /* End of function r_sdsi_dev_open() */

/**********************************************************************************************************************
* Function Name: r_sdsi_dev_close
* Description  : Sets SDSI register for R_SDSI_Close() function.
* Arguments    : uint32_t           channel              ;   SDSI Channel No.
* Return Value : SDSI_SUCCESS                            ;   Successful operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        :  None
**********************************************************************************************************************/
sdsi_status_t r_sdsi_dev_close(uint32_t channel)
{
    sdsi_hndl_t * p_hndl = 0;

    p_hndl = SDSI_GET_HNDL(channel);

    /* Reset SDSI. */
    SDSI_OUTREG_LONG(p_hndl, SDSI_SDSICR3,  SDSI_SDSICR3_SRST_ENABLE);
    if (0 == SDSI_INREG_LONG(p_hndl, SDSI_SDSICR3))
    {
        R_BSP_NOP();    /* Wait for the write completion. */
    }
    SDSI_OUTREG_LONG(p_hndl, SDSI_SDSICR3,  SDSI_SDSICR3_SRST_DISABLE);
    if (0 == SDSI_INREG_LONG(p_hndl, SDSI_SDSICR3))
    {
        R_BSP_NOP();    /* Wait for the write completion. */
    }

    /* Disable SDSI interrupts and cleer SDSI status register. */
/*  SDSI_OUTREG_BYTE(p_hndl, SDSI_INTENCR1, SDSI_INTENCR1_DISABLE); */ /* Clear by SDSI reset. */
    SDSI_OUTREG_LONG(p_hndl, SDSI_INTENCR2, SDSI_INTENCR2_DISABLE);
/*  SDSI_OUTREG_BYTE(p_hndl, SDSI_INTSR1,   SDSI_INTSR1_INIT); */ /* Clear by SDSI reset. */
    SDSI_OUTREG_LONG(p_hndl, SDSI_INTSR2,   SDSI_INTSR2_INIT);
    if (SDSI_INTSR2_INIT == SDSI_INREG_LONG(p_hndl, SDSI_INTSR2))
    {
        R_BSP_NOP();    /* Wait for the write completion. */
    }

    return SDSI_SUCCESS;
} /* End of function r_sdsi_dev_close() */

/**********************************************************************************************************************
* Function Name: r_sdsi_dev_initialize
* Description  : Sets SDSI register for R_SDSI_Initialize() function.
* Arguments    : uint32_t           channel              ;   SDSI Channel No.
* Return Value : SDSI_SUCCESS                            ;   Successful operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        :  None
**********************************************************************************************************************/
sdsi_status_t r_sdsi_dev_initialize(uint32_t channel)
{
    sdsi_hndl_t * p_hndl = 0;
    uint32_t      reg = 0;

