renesas/rx-driver-package/source/r_sdsi_rx/r_sdsi_rx_vx.xx/r_sdsi_rx/src/targets/rx65n/r_sdsi_dev.c
    p_hndl = SDSI_GET_HNDL(channel);

    /* Reset SDSI. */
    SDSI_OUTREG_LONG(p_hndl, SDSI_SDSICR3,  SDSI_SDSICR3_SRST_ENABLE);
    if (0 == SDSI_INREG_LONG(p_hndl, SDSI_SDSICR3))
    {
        R_BSP_NOP();    /* Wait for the write completion. */
    }
    SDSI_OUTREG_LONG(p_hndl, SDSI_SDSICR3,  SDSI_SDSICR3_SRST_DISABLE);
    if (0 == SDSI_INREG_LONG(p_hndl, SDSI_SDSICR3))
    {
        R_BSP_NOP();    /* Wait for the write completion. */
    }

    /* Disable SDSI interrupts and cleer SDSI status register. */
/*  SDSI_OUTREG_BYTE(p_hndl, SDSI_INTENCR1, SDSI_INTENCR1_DISABLE); */ /* Clear by SDSI reset. */
    SDSI_OUTREG_LONG(p_hndl, SDSI_INTENCR2, SDSI_INTENCR2_DISABLE);
/*  SDSI_OUTREG_BYTE(p_hndl, SDSI_INTSR1,   SDSI_INTSR1_INIT); */ /* Clear by SDSI reset. */
    SDSI_OUTREG_LONG(p_hndl, SDSI_INTSR2,   SDSI_INTSR2_INIT);

    /* Enable access to function1 by the CPU. */
    SDSI_OUTREG_LONG(p_hndl, SDSI_FN1ACCR,  SDSI_FN1ACC_ENABLE); 

    /* Disable direct transfer and not lock internal main bus. */
/*  SDSI_OUTREG_BYTE(p_hndl, SDSI_DMACR1, SDSI_DMACR1_DISABLE); */ /* Clear by SDSI reset. */

    /* Set FBRn register. */
    reg = (uint32_t)((uint32_t)(SDSI_CFG_FBR_ADR_101H << SDSI_BIT_SHIFT_8) |
                                SDSI_CFG_FBR_ADR_100H);
    SDSI_OUTREG_LONG(p_hndl, SDSI_FBR1, reg);
    SDSI_OUTREG_LONG(p_hndl, SDSI_FBR2, (uint32_t)SDSI_CFG_FBR_ADR_103H);
    reg = 0;
    reg = (uint32_t)((uint32_t)(SDSI_CFG_FBR_ADR_105H << SDSI_BIT_SHIFT_8) |
                                SDSI_CFG_FBR_ADR_104H);
    SDSI_OUTREG_LONG(p_hndl, SDSI_FBR3, reg);
    reg = 0;
    reg = (uint32_t)((uint32_t)(SDSI_CFG_FBR_ADR_107H << SDSI_BIT_SHIFT_8) |
                                SDSI_CFG_FBR_ADR_106H);
    SDSI_OUTREG_LONG(p_hndl, SDSI_FBR4, reg);
    SDSI_OUTREG_LONG(p_hndl, SDSI_FBR5, (uint32_t)SDSI_CFG_FBR_ADR_108H);

    /* Enable to access from the SD host controller and
       Set swap the data of register 1 to 5 in function 1 in byte units.
       Not get DMA bus of the SDSI and set swap the data for direct transfer in byte units. */
    SDSI_OUTREG_LONG(p_hndl, SDSI_SDSICR2,  SDSI_SDSICR2_INIT);
    SDSI_OUTREG_LONG(p_hndl, SDSI_DMACR2,   SDSI_DMACR2_INIT);

    /* Enable SDSI interrupts. */
    SDSI_OUTREG_BYTE(p_hndl, SDSI_INTENCR1, SDSI_INTENCR1_ENABLE);
    SDSI_OUTREG_LONG(p_hndl, SDSI_INTENCR2, SDSI_INTENCR2_ENABLE);

    /* Enable CCCR.IOE1/IOR1(Function1). */
    SDSI_OUTREG_BYTE(p_hndl, SDSI_SDSICR1,  SDSI_SDSICR1_IOE1IOR1);

    /* Enable CCCR.IOR0(Function0). */
    reg = (SDSI_CFG_FBR_SPS_BIT << SDSI_BIT_SHIFT_18);
    reg |= (SDSI_CFG_CCCR_SMPC_BIT << SDSI_BIT_SHIFT_19);
    reg |= SDSI_SDSICR3_IOR0;
    SDSI_OUTREG_LONG(p_hndl, SDSI_SDSICR3, reg);
    if (0 == SDSI_INREG_LONG(p_hndl, SDSI_SDSICR3))
    {
        R_BSP_NOP();    /* Wait for the write completion. */
    }

    return SDSI_SUCCESS;
} /* End of function r_sdsi_dev_initialize() */

/**********************************************************************************************************************
* Function Name: r_sdsi_dev_end
* Description  : Sets SDSI register for R_SDSI_End() function.
* Arguments    : uint32_t           channel              ;   SDSI Channel No.
* Return Value : SDSI_SUCCESS                            ;   Successful operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        :  None
**********************************************************************************************************************/
sdsi_status_t r_sdsi_dev_end(uint32_t channel)
{
    sdsi_hndl_t * p_hndl = 0;
    uint32_t      reg = 0;

    p_hndl = SDSI_GET_HNDL(channel);

    /* Disable CCCR.IOR0(Function0). */
    reg = (SDSI_INREG_LONG(p_hndl, SDSI_SDSICR3) & (uint32_t)~SDSI_SDSICR3_IOR0);
    SDSI_OUTREG_LONG(p_hndl, SDSI_SDSICR3,  reg);

    /* Disable CCCR.IOE1/IOR1(Function1). */
    reg = (SDSI_INREG_BYTE(p_hndl, SDSI_SDSICR1) & (~SDSI_SDSICR1_IOE1IOR1));
    SDSI_OUTREG_BYTE(p_hndl, SDSI_SDSICR1,  reg);

    /* Disable SDSI interrupts and cleer SDSI status register. */
    SDSI_OUTREG_BYTE(p_hndl, SDSI_INTENCR1, SDSI_INTENCR1_DISABLE);
    SDSI_OUTREG_LONG(p_hndl, SDSI_INTENCR2, SDSI_INTENCR2_DISABLE);
    SDSI_OUTREG_BYTE(p_hndl, SDSI_INTSR1,   SDSI_INTSR1_INIT);
    SDSI_OUTREG_LONG(p_hndl, SDSI_INTSR2,   SDSI_INTSR2_INIT);

    /* Reset swap the data of register 1 to 5 in function 1 in byte units.
       Not get DMA bus of the SDSI and set swap the data for direct transfer in byte units. */
    SDSI_OUTREG_LONG(p_hndl, SDSI_SDSICR2,  SDSI_SDSICR2_SWAP_DISABLE);
    SDSI_OUTREG_LONG(p_hndl, SDSI_DMACR2,   SDSI_DMACR2_SWAP_DISABLE);

    return SDSI_SUCCESS;
} /* End of function r_sdsi_dev_end() */

/**********************************************************************************************************************
* Function Name: r_sdsi_dev_c_flag_polling
* Description  : Check the C Flag.
* Arguments    : uint32_t           channel              ;   SDSI Channel No.
* Return Value : SDSI_SUCCESS                            ;   C Flag is 1 (Ready).
*              : SDSI_ERR                                ;   C Flag is 0 (Busy).
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
sdsi_status_t r_sdsi_dev_c_flag_polling(uint32_t channel)
{
    sdsi_hndl_t * p_hndl = 0;

    p_hndl = SDSI_GET_HNDL(channel);

    /* Check the C Flag. */
    if (SDSI_SDSICR3_CEN == (SDSI_INREG_LONG(p_hndl, SDSI_SDSICR3) & SDSI_SDSICR3_CEN))
    {
        return SDSI_SUCCESS;
    }
    return SDSI_ERR;
} /* End of function r_sdsi_dev_c_flag_polling() */

/**********************************************************************************************************************
* Function Name: r_sdsi_dev_write_cis_reg
* Description  : Sets SDSI CIS register for R_SDSI_WriteCisReg() function.
* Arguments    : uint32_t           channel              ;   SDSI Channel No.
*              : sdsi_reg_t * p_sdsi_reg                 ;
*              :    uint32_t    reg_no                   ;   Ignore value
*              :    uint32_t    offset                   ;   Offset from the targeted register.
*              :    uint32_t    * p_buff                 ;   Register value
* Return Value : SDSI_SUCCESS                            ;   Successful operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        :  None
**********************************************************************************************************************/
sdsi_status_t r_sdsi_dev_write_cis_reg(uint32_t channel, sdsi_cis_reg_t * p_sdsi_reg)
{
    sdsi_hndl_t * p_hndl = 0;
    uint32_t      offset = 0;
    uint32_t      reg = 0;

