renesas/rx-driver-package/source/r_sdsi_rx/r_sdsi_rx_vx.xx/r_sdsi_rx/src/targets/rx65n/r_sdsi_dev.c
    p_hndl = SDSI_GET_HNDL(channel);

    offset = SDSI_CISDATAR0 + p_sdsi_reg->offset;

#if (SDSI_BIG_ENDIAN)
    reg = *p_sdsi_reg->p_buff;
#else
    reg = R_BSP_REVL(*p_sdsi_reg->p_buff);
#endif /* (SDSI_BIG_ENDIAN) */

    /* Write CIS register. */
    SDSI_OUTREG_LONG(p_hndl, offset, reg);
    if (0 == SDSI_INREG_LONG(p_hndl, offset))
    {
        R_BSP_NOP();    /* Wait for the write completion. */
    }
    return SDSI_SUCCESS;
} /* End of function r_sdsi_dev_write_cis_reg() */

/**********************************************************************************************************************
* Function Name: r_sdsi_dev_read_cis_reg
* Description  : Gets SDSI CIS register for R_SDSI_ReadCisReg() function.
* Arguments    : uint32_t           channel              ;   SDSI Channel No.
*              : sdsi_reg_t * p_sdsi_reg                 ;
*              :    uint32_t    reg_no                   ;   Ignore value
*              :    uint32_t    offset                   ;   Offset from the targeted register.
*              :    uint32_t    * p_buff                 ;   Register value
* Return Value : SDSI_SUCCESS                            ;   Successful operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        :  None
**********************************************************************************************************************/
sdsi_status_t r_sdsi_dev_read_cis_reg(uint32_t channel, sdsi_cis_reg_t * p_sdsi_reg)
{
    sdsi_hndl_t * p_hndl = 0;
    uint32_t      offset = 0;
    uint32_t      reg = 0;

    p_hndl = SDSI_GET_HNDL(channel);

    offset = SDSI_CISDATAR0 + p_sdsi_reg->offset;

    /* Read CIS register. */
    reg = SDSI_INREG_LONG(p_hndl, offset);

#if (SDSI_BIG_ENDIAN)
    *p_sdsi_reg->p_buff = reg;
#else
    *p_sdsi_reg->p_buff = R_BSP_REVL(reg);
#endif /* (SDSI_BIG_ENDIAN) */


    return SDSI_SUCCESS;
} /* End of function r_sdsi_dev_read_cis_reg() */

/**********************************************************************************************************************
* Function Name: r_sdsi_dev_write_func_reg
* Description  : Sets SDSI function 1 register N for R_SDSI_WriteFuncReg() function.
* Arguments    : uint32_t           channel              ;   SDSI Channel No.
*              : sdsi_reg_t * p_sdsi_reg                 ;
*              :    uint32_t    reg_no                   ;   Ignore value
*              :    uint32_t    offset                   ;   Offset from the targeted register.
*              :    uint32_t    * p_buff                 ;   Register value
* Return Value : SDSI_SUCCESS                            ;   Successful operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        :  None
**********************************************************************************************************************/
sdsi_status_t r_sdsi_dev_write_func_reg(uint32_t channel, sdsi_func_reg_t * p_sdsi_reg)
{
    sdsi_hndl_t * p_hndl = 0;
    uint32_t      offset = 0;
    uint32_t      reg = 0;

    p_hndl = SDSI_GET_HNDL(channel);

    offset = (SDSI_FN1DATAR10 + ((p_sdsi_reg->reg_no - 1) * 0x100)) + p_sdsi_reg->offset;

    /* Enable function 1 register 5 access. */
    if (SDSI_FUNC1_REG5 == p_sdsi_reg->reg_no)
    {
//        reg = (SDSI_INREG_LONG(p_hndl, SDSI_SDSICR2) | SDSI_SDSICR2_REG5EN_ENABLE);
        reg = (SDSI_INREG_BYTE(p_hndl, SDSI_SDSICR2) | SDSI_SDSICR2_REG5EN_ENABLE);
//        SDSI_OUTREG_LONG(p_hndl, SDSI_SDSICR2,  reg);
        SDSI_OUTREG_BYTE(p_hndl, SDSI_SDSICR2,  reg);
//        if (0 == SDSI_INREG_LONG(p_hndl, SDSI_SDSICR2))
        if (0 == SDSI_INREG_BYTE(p_hndl, SDSI_SDSICR2))
        {
            R_BSP_NOP();    /* Wait for the write completion. */
        }
    }

    /* Write function 1 register N. */
    reg = *p_sdsi_reg->p_buff;
//    SDSI_OUTREG_LONG(p_hndl, offset, reg);
    SDSI_OUTREG_BYTE(p_hndl, offset, reg);
//    if (0 == SDSI_INREG_LONG(p_hndl, offset))
    if (0 == SDSI_INREG_BYTE(p_hndl, offset))
    {
        R_BSP_NOP();    /* Wait for the write completion. */
    }

    /* Disable function 1 register 5 access. */
    if (SDSI_FUNC1_REG5 == p_sdsi_reg->reg_no)
    {
//        reg = (SDSI_INREG_LONG(p_hndl, SDSI_SDSICR2) & (uint32_t)~SDSI_SDSICR2_REG5EN_ENABLE);
        reg = (SDSI_INREG_BYTE(p_hndl, SDSI_SDSICR2) & (uint8_t)~SDSI_SDSICR2_REG5EN_ENABLE);
//        SDSI_OUTREG_LONG(p_hndl, SDSI_SDSICR2,  reg);
        SDSI_OUTREG_BYTE(p_hndl, SDSI_SDSICR2,  reg);
//        if (0 == SDSI_INREG_LONG(p_hndl, SDSI_SDSICR2))
        if (0 == SDSI_INREG_BYTE(p_hndl, SDSI_SDSICR2))
        {
            R_BSP_NOP();    /* Wait for the write completion. */
        }
    }

    return SDSI_SUCCESS;
} /* End of function r_sdsi_dev_write_func_reg() */

/**********************************************************************************************************************
* Function Name: r_sdsi_dev_read_func_reg
* Description  : Gets SDSI function 1 register N for R_SDSI_ReadFuncReg() function.
* Arguments    : uint32_t           channel              ;   SDSI Channel No.
*              : sdsi_reg_t * p_sdsi_reg                 ;
*              :    uint32_t    reg_no                   ;   Ignore value
*              :    uint32_t    offset                   ;   Offset from the targeted register.
*              :    uint32_t    * p_buff                 ;   Register value
* Return Value : SDSI_SUCCESS                            ;   Successful operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        :  None
**********************************************************************************************************************/
sdsi_status_t r_sdsi_dev_read_func_reg(uint32_t channel, sdsi_func_reg_t * p_sdsi_reg)
{
    sdsi_hndl_t * p_hndl = 0;
    uint32_t      offset = 0;
    uint32_t      reg = 0;

