renesas/rx-driver-package/source/r_sdsi_rx/r_sdsi_rx_vx.xx/r_sdsi_rx/src/targets/rx65n/r_sdsi_dev.c
    p_hndl = SDSI_GET_HNDL(channel);

    offset = (SDSI_FN1DATAR10 + ((p_sdsi_reg->reg_no - 1) * 0x100)) + p_sdsi_reg->offset;

    /* Enable function 1 register 5 access. */
    if (SDSI_FUNC1_REG5 == p_sdsi_reg->reg_no)
    {
//        reg = (SDSI_INREG_LONG(p_hndl, SDSI_SDSICR2) | SDSI_SDSICR2_REG5EN_ENABLE);
        reg = (SDSI_INREG_BYTE(p_hndl, SDSI_SDSICR2) | SDSI_SDSICR2_REG5EN_ENABLE);
//        SDSI_OUTREG_LONG(p_hndl, SDSI_SDSICR2,  reg);
        SDSI_OUTREG_BYTE(p_hndl, SDSI_SDSICR2,  reg);
//        if (0 == SDSI_INREG_LONG(p_hndl, SDSI_SDSICR2))
        if (0 == SDSI_INREG_BYTE(p_hndl, SDSI_SDSICR2))
        {
            R_BSP_NOP();    /* Wait for the write completion. */
        }
    }

    /* Read function 1 register N. */
//      reg = SDSI_INREG_LONG(p_hndl, offset);
      reg = SDSI_INREG_BYTE(p_hndl, offset);
    *p_sdsi_reg->p_buff = reg;

    /* Disable function 1 register 5 access. */
    if (SDSI_FUNC1_REG5 == p_sdsi_reg->reg_no)
    {
//        reg = (SDSI_INREG_LONG(p_hndl, SDSI_SDSICR2) & (uint32_t)~SDSI_SDSICR2_REG5EN_ENABLE);
        reg = (SDSI_INREG_BYTE(p_hndl, SDSI_SDSICR2) & (uint8_t)~SDSI_SDSICR2_REG5EN_ENABLE);
//        SDSI_OUTREG_LONG(p_hndl, SDSI_SDSICR2,  reg);
        SDSI_OUTREG_BYTE(p_hndl, SDSI_SDSICR2,  reg);
//        if (0 == SDSI_INREG_LONG(p_hndl, SDSI_SDSICR2))
        if (0 == SDSI_INREG_BYTE(p_hndl, SDSI_SDSICR2))
        {
            R_BSP_NOP();    /* Wait for the write completion. */
        }
    }

    return SDSI_SUCCESS;
} /* End of function r_sdsi_dev_read_func_reg() */

/**********************************************************************************************************************
* Function Name: r_sdsi_dev_write_int_vector_reg
* Description  : Sets SDIO interrupt vector(FN1INTVECR).
* Arguments    : uint32_t       channel                 ;   SDSI Channel No.
*              : uint8_t        vector                  ;   SDIO interrupt vector
* Return Value : SDSI_SUCCESS                           ;   Successful operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
sdsi_status_t r_sdsi_dev_write_int_vector_reg(uint32_t channel, uint8_t vector)
{
    sdsi_hndl_t * p_hndl = 0;

    p_hndl = SDSI_GET_HNDL(channel);

    /* Set SDIO interrupt vector. */
    SDSI_OUTREG_BYTE(p_hndl, SDSI_FN1INTVECR, vector);
    if (0 == SDSI_INREG_BYTE(p_hndl, SDSI_FN1INTVECR))
    {
        R_BSP_NOP();    /* Wait for the write completion. */
    }

    return SDSI_SUCCESS;
} /* End of function r_sdsi_dev_write_int_vector_reg() */

/**********************************************************************************************************************
* Function Name: r_sdsi_dev_read_int_vector_reg
* Description  : Gets SDIO interrupt vector(FN1INTVECR).
* Arguments    : uint32_t       channel                 ;   SDSI Channel No.
*              : uint8_t        * p_vector              ;   SDIO interrupt vector buffer
* Return Value : SDSI_SUCCESS                           ;   Successful operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
sdsi_status_t r_sdsi_dev_read_int_vector_reg(uint32_t channel, uint8_t * p_vector)
{
    sdsi_hndl_t * p_hndl = 0;

    p_hndl = SDSI_GET_HNDL(channel);

    /* Get SDIO interrupt vector. */
    *p_vector = SDSI_INREG_BYTE(p_hndl, SDSI_FN1INTVECR);

    return SDSI_SUCCESS;
} /* End of function r_sdsi_dev_read_int_vector_reg() */

/**********************************************************************************************************************
* Function Name: r_sdsi_dev_read_int_clear_reg
* Description  : Gets SDIO interrupt vector clear register(FN1INTCLRR).
* Arguments    : uint32_t       channel                 ;   SDSI Channel No.
*              : uint8_t        * p_vector              ;   SDIO interrupt vector clear buffer
* Return Value : SDSI_SUCCESS                           ;   Successful operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
sdsi_status_t r_sdsi_dev_read_int_clear_reg(uint32_t channel, uint8_t * p_vector)
{
    sdsi_hndl_t * p_hndl = 0;

    p_hndl = SDSI_GET_HNDL(channel);

    /* Get SDIO interrupt vector clear register. */
    *p_vector = SDSI_INREG_BYTE(p_hndl, SDSI_FN1INTCLRR);

    return SDSI_SUCCESS;
} /* End of function r_sdsi_dev_read_int_clear_reg() */

/**********************************************************************************************************************
* Function Name: r_sdsi_dev_chk_direct_trans_adr
* Description  : Checks the direct transfer address.
* Arguments    : uint32_t           channel              ;   SDSI Channel No.
*              : uint32_t           adr                  ;   Direct transfer address
* Return Value : SDSI_SUCCESS                            ;   Successful operation
*              : SDSI_ERR                                ;   Failed operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        :  None
**********************************************************************************************************************/
sdsi_status_t r_sdsi_dev_chk_direct_trans_adr(uint32_t channel, uint32_t adr)
{
    if (BSP_RAM_SIZE_BYTES < adr)
    {
        SDSI_LOG_FUNC(SDSI_DEBUG_ERR_ID, (uint32_t)SDSI_DEV, __LINE__);
        return SDSI_ERR;
    }
    
    /* Check the address boundary (4-byte unit) */
    if (adr & SDSI_ADDR_BOUNDARY)
    {
        SDSI_LOG_FUNC(SDSI_DEBUG_ERR_ID, (uint32_t)SDSI_DEV, __LINE__);
        return SDSI_ERR_ADDRESS_BOUNDARY;
    }
    
    return SDSI_SUCCESS;
} /* End of function r_sdsi_dev_chk_direct_trans_adr() */

/**********************************************************************************************************************
* Function Name: r_sdsi_dev_enable_direct_trans
* Description  : Enables direct transfer.
* Arguments    : uint32_t           channel              ;   SDSI Channel No.
*              : sdsi_direct_trans_t    * p_sdsi_direct_trans   ;
*              :    uint32_t    adr                      ;   Direct transfer address
*              :    uint32_t    mode                     ;   Mode
*              :       SDSI_MODE_DIRECT_ADDR_FIXED       ;   Direct transfer address is fixed.
*              :       SDSI_MODE_DIRECT_ADDR_INC         ;   Direct transfer address is incremented after each transfer.
*              :       SDSI_MODE_DIRECT_BUS_LOCK         ;   Internal main bus is locked.
*              :       SDSI_MODE_DIRECT_BUS_UNLOCK       ;   Internal main bus is not locked.
* Return Value : SDSI_SUCCESS                            ;   Successful operation
*              : SDSI_ERR                                ;   Failed operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        :  None
**********************************************************************************************************************/
sdsi_status_t r_sdsi_dev_enable_direct_trans(uint32_t channel, sdsi_direct_trans_t * p_sdsi_direct_trans)
{
    sdsi_hndl_t * p_hndl = 0;
    uint32_t      reg = 0;
#ifdef SDSI_CFG_USE_FIT
    bool          chk = false;

