renesas/rx-driver-package/source/r_sdsi_rx/r_sdsi_rx_vx.xx/r_sdsi_rx/src/targets/rx65n/r_sdsi_dev.c
    /* Get the EDMAC0 hardware resource. */
    chk = R_BSP_HardwareLock((mcu_lock_t)BSP_LOCK_EDMAC0);
    if (false == chk)
    {
        /* Lock has already been acquired by another task. Needs to try again later. */
        SDSI_LOG_FUNC(SDSI_DEBUG_ERR_ID, (uint32_t)SDSI_DEV, __LINE__);
        return SDSI_ERR;
    }
#endif /* SDSI_CFG_USE_FIT */

    /* Check ETHER0 module stop bit. */
    if (0 == MSTP_ETHERC0)
    {
#ifdef SDSI_CFG_USE_FIT
        R_BSP_HardwareUnlock((mcu_lock_t)BSP_LOCK_EDMAC0);
#endif /* SDSI_CFG_USE_FIT */
        SDSI_LOG_FUNC(SDSI_DEBUG_ERR_ID, (uint32_t)SDSI_DEV, __LINE__);
        return SDSI_ERR;
    }

    p_hndl = SDSI_GET_HNDL(channel);

    /* Set direct transfer address. */
    SDSI_OUTREG_LONG(p_hndl, SDSI_DMATRADDR,  p_sdsi_direct_trans->adr);

    /* Get DMA bus of the SDSI. */
    reg = (SDSI_INREG_LONG(p_hndl, SDSI_DMACR2) | SDSI_DMACR2_DMASDSEL);
    SDSI_OUTREG_LONG(p_hndl, SDSI_DMACR2, reg);

    if (SDSI_MODE_DIRECT_BUS_LOCK == (p_sdsi_direct_trans->mode & SDSI_MODE_DIRECT_BUS_LOCK))
    {
        /* Lock internal main bus and enable direct transfer. */
        SDSI_OUTREG_BYTE(p_hndl, SDSI_DMACR1, SDSI_DMACR1_ENABLE_BUS_LOCK);
    }
    else
    {
        /* Not lock internal main bus and enable direct transfer. */
        SDSI_OUTREG_BYTE(p_hndl, SDSI_DMACR1, SDSI_DMACR1_ENABLE_BUS_UNLOCK);
    }
    
    if (0 == SDSI_INREG_BYTE(p_hndl, SDSI_DMACR1))
    {
        R_BSP_NOP();    /* Wait for the write completion. */
    }

    return SDSI_SUCCESS;
} /* End of function r_sdsi_dev_enable_direct_trans() */

/**********************************************************************************************************************
* Function Name: r_sdsi_dev_disable_direct_trans
* Description  : Disables dierct transfer.
* Arguments    : uint32_t           channel              ;   SDSI Channel No.
* Return Value : SDSI_SUCCESS                            ;   Successful operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        :  None
**********************************************************************************************************************/
sdsi_status_t r_sdsi_dev_disable_direct_trans(uint32_t channel)
{
    sdsi_hndl_t * p_hndl = 0;
    uint32_t      reg = 0;

    p_hndl = SDSI_GET_HNDL(channel);

    /* Disable direct transfer and not lock internal main bus. */
    SDSI_OUTREG_BYTE(p_hndl, SDSI_DMACR1, SDSI_DMACR1_DISABLE);

    /* Release DMA bus of the SDSI. */
    reg = (SDSI_INREG_LONG(p_hndl, SDSI_DMACR2) & (uint32_t)~SDSI_DMACR2_DMASDSEL);
    SDSI_OUTREG_LONG(p_hndl, SDSI_DMACR2, reg);
    if (0 == SDSI_INREG_LONG(p_hndl, SDSI_DMACR2))
    {
        R_BSP_NOP();    /* Wait for the write completion. */
    }

#ifdef SDSI_CFG_USE_FIT
    R_BSP_HardwareUnlock((mcu_lock_t)BSP_LOCK_EDMAC0);
#endif /* SDSI_CFG_USE_FIT */

    return SDSI_SUCCESS;
} /* End of function r_sdsi_dev_disable_direct_trans() */

/**********************************************************************************************************************
* Function Name: r_sdsi_dev_set_direct_trans_adr
* Description  : Sets dierct transfer.
* Arguments    : uint32_t           channel              ;   SDSI Channel No.
*              : uint32_t           adr                  ;   Direct transfer address
* Return Value : SDSI_SUCCESS                            ;   Successful operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        :  None
**********************************************************************************************************************/
sdsi_status_t r_sdsi_dev_set_direct_trans_adr(uint32_t channel, uint32_t adr)
{
    sdsi_hndl_t * p_hndl = 0;

    p_hndl = SDSI_GET_HNDL(channel);

    /* Set direct transfer address. */
    SDSI_OUTREG_LONG(p_hndl, SDSI_DMATRADDR, adr);

    return SDSI_SUCCESS;
} /* End of function r_sdsi_dev_set_direct_trans_adr() */

/**********************************************************************************************************************
* Function Name: r_sdsi_dev_get_direct_trans_adr
* Description  : Gets dierct transfer.
* Arguments    : uint32_t           channel              ;   SDSI Channel No.
*              : uint32_t           * p_adr              ;   Direct transfer address buffer
* Return Value : SDSI_SUCCESS                            ;   Successful operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        :  None
**********************************************************************************************************************/
sdsi_status_t r_sdsi_dev_get_direct_trans_adr(uint32_t channel, uint32_t * p_adr)
{
    sdsi_hndl_t * p_hndl = 0;

    p_hndl = SDSI_GET_HNDL(channel);

    /* Get direct transfer address. */
    *p_adr = SDSI_INREG_LONG(p_hndl, SDSI_DMATRADDR);

    return SDSI_SUCCESS;
} /* End of function r_sdsi_dev_get_direct_trans_adr() */

/**********************************************************************************************************************
* Function Name: r_sdsi_dev_enable_int
* Description  : Enable the Interrupt Request Enable (IENn).
* Arguments    : uint32_t           channel              ;   SDSI Channel No.
* Return Value : SDSI_SUCCESS                            ;   Successful operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
sdsi_status_t r_sdsi_dev_enable_int(uint32_t channel)
{
#ifdef SDSI_CFG_USE_FIT
    uint32_t ipl = 0;
#endif /* SDSI_CFG_USE_FIT */

    if (SDSI_CH0 == channel)
    {
#if defined(SDSI_CFG_CH0_INCLUDED)
        /* ---- Enable interrupt request (IENn) of IER. ---- */
        ICU.GENBL2.BIT.EN0 = 1;
        if (1 == ICU.GENBL2.BIT.EN0)
        {
            R_BSP_NOP();    /* Wait for the write completion. */
        }
#ifdef SDSI_CFG_USE_FIT
        ipl = SDSI_CFG_CH0_INT_LEVEL;
        R_BSP_InterruptControl(BSP_INT_SRC_BL2_SDSI_SDIOI, BSP_INT_CMD_GROUP_INTERRUPT_ENABLE, (void *)&ipl);
#else
        IPR(ICU,GROUPBL2)  = SDSI_CFG_CH0_INT_LEVEL;
        R_BSP_InterruptRequestEnable(VECT(ICU,GROUPBL2));
        if (1 == IEN(ICU,GROUPBL2))
        {
            R_BSP_NOP();    /* Wait for the write completion. */
        }
#endif /* SDSI_CFG_USE_FIT */
#endif /* SDSI_CFG_CH0_INCLUDED */
    }
    else
    {
        /* Do nothing. */
    }

    return SDSI_SUCCESS;
} /* End of function r_sdsi_dev_enable_int() */

/**********************************************************************************************************************
* Function Name: r_sdsi_dev_disable_int
* Description  : Disable the Interrupt Request Enable (IENn).
* Arguments    : uint32_t           channel              ;   SDSI Channel No.
* Return Value : SDSI_SUCCESS                            ;   Successful operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
sdsi_status_t r_sdsi_dev_disable_int(uint32_t channel)
{
#ifdef SDSI_CFG_USE_FIT
    uint32_t ipl = 0;
#endif /* SDSI_CFG_USE_FIT */

    if (SDSI_CH0 == channel)
    {
#if defined(SDSI_CFG_CH0_INCLUDED)
        /* ---- Disable interrupt request (IENn) of IER. ---- */
        ICU.GENBL2.BIT.EN0 = 0;
        if (0 == ICU.GENBL2.BIT.EN0)
        {
            R_BSP_NOP();    /* Wait for the write completion. */
        }
#ifdef SDSI_CFG_USE_FIT
        ipl = 0;
        R_BSP_InterruptControl(BSP_INT_SRC_BL2_SDSI_SDIOI, BSP_INT_CMD_GROUP_INTERRUPT_DISABLE, (void *)&ipl);
#else
        R_BSP_InterruptRequestDisable(VECT(ICU,GROUPBL2));
        IPR(ICU,GROUPBL2)  = 0;
        if (0 == IPR(ICU,GROUPBL2))
        {
            R_BSP_NOP();    /* Wait for the write completion. */
        }
#endif /* SDSI_CFG_USE_FIT */
#endif /* SDSI_CFG_CH0_INCLUDED */
    }
    else
    {
        /* Do nothing. */
    }

    return SDSI_SUCCESS;
} /* End of function r_sdsi_dev_disable_int() */

/**********************************************************************************************************************
* Function Name: r_sdsi_dev_get_int
* Description  : Gets the INTSR1 and INTSR2 interrupt sources, and then bits examine enabled elements hereafter
*              : clears INTSR1 and INTSR2 bits and saves those bits to intsr1 or intsr2.
* Arguments    : uint32_t           channel              ;   SDSI Channel No.
* Return Value : SDSI_SUCCESS                            ;   Successful operation
*              : SDSI_ERR                                ;   Failed operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
sdsi_status_t r_sdsi_dev_get_int(uint32_t channel)
{
    sdsi_hndl_t * p_hndl = 0;
    uint8_t       intsr1 = 0;
    uint32_t      intsr2 = 0;

