renesas/rx-driver-package/source/r_sdsi_rx/r_sdsi_rx_vx.xx/r_sdsi_rx/src/targets/rx65n/r_sdsi_dev.c
    p_hndl = SDSI_GET_HNDL(channel);

    /* Get the INTSR1 and INTSR2 registers. */
    intsr1 = (uint32_t)(SDSI_INREG_BYTE(p_hndl, SDSI_INTSR1) & SDSI_INTENCR1_ENABLE);
    intsr2 = (uint32_t)(SDSI_INREG_LONG(p_hndl, SDSI_INTSR2) & SDSI_INTENCR2_ENABLE);

    /* Clear the INTSR1 and INTSR2 registers. */
    SDSI_OUTREG_BYTE(p_hndl, SDSI_INTSR1, intsr1);
    SDSI_OUTREG_LONG(p_hndl, SDSI_INTSR2, (uint32_t)~intsr2);
    if (0 == SDSI_INREG_LONG(p_hndl, SDSI_INTSR2))
    {
        R_BSP_NOP();    /* Wait for the write completion. */
    }

    /* Store the interrupt sources to the INTSR1 and INTSR2. */
    p_hndl->intsr1 = (p_hndl->intsr1 | intsr1);
    p_hndl->intsr2 = (p_hndl->intsr2 | intsr2);
    if (intsr1 || intsr2)
    {
        return SDSI_SUCCESS;   /* Any interrupt occurred */
    }

    return SDSI_ERR;  /* No interrupt occurred */
} /* End of function r_sdsi_dev_get_int() */

/**********************************************************************************************************************
* Function Name: r_sdsi_dev_clear_int
* Description  : Clears the p_hndl->intsr1 and p_hndl->intsr2.
* Arguments    : uint32_t           channel              ;   SDSI Channel No.
* Return Value : SDSI_SUCCESS                            ;   Successful operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
sdsi_status_t r_sdsi_dev_clear_int(uint32_t channel)
{
    sdsi_hndl_t * p_hndl = 0;

    p_hndl = SDSI_GET_HNDL(channel);

    /* Clear the interrupt sources to the INTSR1 and INTSR2. */
    p_hndl->intsr1 = 0;
    p_hndl->intsr2 = 0;

    return SDSI_SUCCESS;   /* Any interrupt occurred */
} /* End of function r_sdsi_dev_clear_int() */

/**********************************************************************************************************************
* Function Name: r_sdsi_dev_get_cmd_info
* Description  : Gets cmd information.
* Arguments    : uint32_t           channel     ;   SDSI Channel No.
*              : sdsi_cmd_t       * p_sdsi_cmd  ;
*              :    uint32_t    adr             ;   SDIO Register addresses in the argument (Lower 17bits).
*              :    uint16_t    blkcnt          ;   The block count in response to CMD53.
*              :                                ;   If get CMD52_W, set 0 to blkncnt.
*              :    uint16_t    bytcnt          ;   The byte count in response to CMD53.
*              :                                ;   If get CMD52_W, set 0 to bytecnt.
*              :    uint8_t     sdcmdcr         ;   SDCMDCR register value
*              :    uint8_t     cmd             ;   Command
*              :                                ;       SDSI_CMD52_W
*              :                                ;       SDSI_CMD53_W
*              :                                ;       SDSI_CMD53_R
*              :    uint8_t     rsv[2]          ;   Reserved
* Return Value : SDSI_SUCCESS                   ;   Successful operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
sdsi_status_t r_sdsi_dev_get_cmd_info(uint32_t channel, sdsi_cmd_t * p_sdsi_cmd)
{
    sdsi_hndl_t * p_hndl = 0;
    uint32_t adr = 0;

    p_hndl = SDSI_GET_HNDL(channel);

    p_sdsi_cmd->sdcmdcr = SDSI_INREG_BYTE(p_hndl, SDSI_SDCMDCR);

    adr = ((uint32_t)SDSI_INREG_BYTE(p_hndl, SDSI_SDCADD2R) << SDSI_BIT_SHIFT_16);
    adr |= ((uint32_t)SDSI_INREG_BYTE(p_hndl, SDSI_SDCADD1R) << SDSI_BIT_SHIFT_8);
    adr |= (uint32_t)SDSI_INREG_BYTE(p_hndl, SDSI_SDCADD0R);
    p_sdsi_cmd->adr = adr;
    
    if (SDSI_SDCMDCR_SDCMDINDEX == (p_sdsi_cmd->sdcmdcr & SDSI_SDCMDCR_SDCMDINDEX))
    {
        p_sdsi_cmd->blkcnt = SDSI_INREG_WORD(p_hndl, SDSI_BLKCNT);
        p_sdsi_cmd->bytcnt = SDSI_INREG_WORD(p_hndl, SDSI_BYTCNT);
    }
    else
    {
        p_sdsi_cmd->blkcnt = 0;
        p_sdsi_cmd->bytcnt = 0;
    }

    switch (p_hndl->intsr1)
    {
        case SDSI_INTENCR1_CMD52WIREN:
            p_sdsi_cmd->cmd = SDSI_CMD52_W;
        break;
        case SDSI_INTENCR1_CMD53WIREN:
            p_sdsi_cmd->cmd = SDSI_CMD53_W;
        break;
        case SDSI_INTENCR1_CMD53RIREN:
            p_sdsi_cmd->cmd = SDSI_CMD53_R;
        break;
        default:
            /* Do nothing. */
        break;
    }

    return SDSI_SUCCESS;
} /* End of function r_sdsi_dev_get_cmd_info() */

/**********************************************************************************************************************
* Function Name: r_sdsi_dev_update_direct_trans_adr
* Description  : Updates direct address.
* Arguments    : uint32_t           channel              ;   SDSI Channel No.
* Return Value : SDSI_SUCCESS                            ;   Successful operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
sdsi_status_t r_sdsi_dev_update_direct_trans_adr(uint32_t channel)
{
    sdsi_hndl_t * p_hndl = 0;
    uint32_t      adr = 0;

    p_hndl = SDSI_GET_HNDL(channel);

    adr = SDSI_INREG_LONG(p_hndl, SDSI_DMATRADDR);
    SDSI_OUTREG_LONG(p_hndl, SDSI_DMATRADDR, adr);
    if (0 == SDSI_INREG_LONG(p_hndl, SDSI_DMATRADDR))
    {
        R_BSP_NOP();    /* Wait for the write completion. */
    }

    return SDSI_SUCCESS;
} /* End of function r_sdsi_dev_update_direct_trans_adr() */

/**********************************************************************************************************************
* Function Name: R_SDSI_IntHandler0
* Description  : Checks the relevant elements (without masked) and call a callback function.
* Arguments    : uint32_t           channel              ;   SDSI Channel No.
* Return Value : None
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
void R_SDSI_IntHandler0(void * vect)
{
    sdsi_hndl_t   * p_hndl  = 0;
    uint32_t        channel = 0;
    sdsi_cmd_t      cmd;

    channel = 0;
    p_hndl = SDSI_GET_HNDL(channel);
#if (SDSI_CFG_PARAM_CHECKING_ENABLE == 1)
    if (0 == p_hndl)
    {
        return;
    }
#endif /* SDSI_CFG_PARAM_CHECKING_ENABLE == 1 */

    if (r_sdsi_dev_get_int(channel) == SDSI_SUCCESS)
    {
        r_sdsi_dev_get_cmd_info(channel, &cmd);
        if (p_hndl->intsr1)
        {
            if (p_hndl->int_callback)
            {
                (*p_hndl->int_callback)(&cmd);
            }
        }
        if (p_hndl->intsr2 & SDSI_INTENCR2_CDFEN)
        {
            if (p_hndl->int_cd_callback)
            {
                (*p_hndl->int_cd_callback)(SDSI_CD_FALL);
            }
        }
        if (p_hndl->intsr2 & SDSI_INTENCR2_CDREN)
        {
            if (p_hndl->int_cd_callback)
            {
                (*p_hndl->int_cd_callback)(SDSI_CD_RISE);
            }
        }
        if (p_hndl->intsr2 & SDSI_INTENCR2_DTEEN)
        {
            /* Update direct address. */
            if (p_hndl->direct_trans_mode & SDSI_MODE_DIRECT_ADDR_INC)
            {
                r_sdsi_dev_update_direct_trans_adr(channel);
            }
            if (p_hndl->int_dt_callback)
            {
                (*p_hndl->int_dt_callback)(&cmd);
            }
        }
        r_sdsi_dev_clear_int(channel);
    }
    return;
} /* End of function R_SDSI_IntHandler0() */

#endif /* defined(BSP_MCU_RX65N) */

/* End of File */
